app/views/outfits/_form.html.erb

SELECT DISTINCT "pieces".id FROM "pieces" INNER JOIN "outfits_pieces" ON "pieces"."id" = "outfits_pieces"."piece_id" WHERE "outfits_pieces"."outfit_id" IS NULL
---
  </div>
	<%= f.collection_select(:piece_ids, Piece.all, :id, :name, {:include_blank => true}, {:selected => @outfit.piece_ids, :multiple => true} )%>