app/views/outfits/_outfit.html.erb

SELECT "pieces".* FROM "pieces" INNER JOIN "outfits_pieces" ON "pieces"."id" = "outfits_pieces"."piece_id" WHERE "outfits_pieces"."outfit_id" = 1
---
<div id = "outfit-feed">
<% outfit.pieces.each do |piece| %>