app/views/users/show.html.erb

<%= render 'follow_form' if signed_in? %>
<p><%= @user.pieces.count %> pieces
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."user_id" = 4
SELECT COUNT(*) FROM "pieces" WHERE "pieces"."user_id" = 1

</p>
<p><%= @user.outfits.count %> outfits
---
SELECT COUNT(*) FROM "outfits" WHERE "outfits"."user_id" = 1