app/controllers/outfits_controller.rb

SELECT "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @outfit = Outfit.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "outfits" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 15 Dec 2011 21:17:12 UTC +00:00], ["description", "This is a test outfit"], ["title", "Summer"], ["updated_at", Thu, 15 Dec 2011 21:17:12 UTC +00:00], ["user_id", 4]]
---
  def create
    @user = User.find(params[:user_id])
    @outfit = @user.outfits.create(params[:outfit])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = 6 AND "outfits"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "outfits" WHERE "outfits"."id" = ?  [["id", 4]]
---
  def destroy
    @user = User.find(params[:user_id])
    @outfit = @user.outfits.find(params[:id])
    @outfit.destroy