app/controllers/pieces_controller.rb

  def show
    @piece = Piece.find(params[:id])
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @user = User.find(params[:user_id])
    @piece = @user.pieces.create(params[:piece])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "pieces" ("created_at", "link", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 14 Dec 2011 01:43:10 UTC +00:00], ["link", "google.com"], ["name", "Shirt"], ["updated_at", Wed, 14 Dec 2011 01:43:10 UTC +00:00], ["user_id", 4]]

  def destroy
    @user = User.find(params[:user_id])
    @piece = @user.pieces.find(params[:id])
    @piece.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."user_id" = 4 AND "pieces"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "pieces" WHERE "pieces"."id" = ?  [["id", 1]]