app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
  def create
    @user = User.find(params[:relationship][:followed_id])