app/controllers/users_controller.rb

  def edit
    @title = "Edit User"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("about", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "email", "encrypted_password", "location", "name", "salt", "slug", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @title = @user.name
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "users" SET "location" = 'NYC', "slug" = 'mike', "updated_at" = '2012-06-13 19:46:01.752564', "name" = 'Mike', "encrypted_password" = '481297c15dcd3c3d0144e027dd5b3cb786cdd5d9d83e66a04bebfad4fa6bd41e', "about" = 'HELLO', "salt" = 'a0994b4c413c2df83d01ef0d1d20f6deee5c6c20858501e3c4b520b9d5f46f16' WHERE "users"."id" = 2